app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ?  ORDER BY created_at desc  [["user_id", 1]]
---
  def index
    @blogs = Blog.where({user_id: current_user.id}).order("created_at desc").all

INSERT INTO "blogs" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New Title"], ["content", "<p>blog body</p>"], ["user_id", 1], ["created_at", "2016-10-07 05:19:52.810155"], ["updated_at", "2016-10-07 05:19:52.810155"]]
---
  def create
    @blog = current_user.blogs.build(blog_params)
    if @blog.save

UPDATE "blogs" SET "content" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["content", "New Attribute"], ["updated_at", "2016-10-07 05:19:53.000076"], ["id", 1]]
---
  def update
    if @blog.update(blog_params)

DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 1]]
---
  def destroy
    @blog.destroy

SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_blog
      @blog = Blog.find(params[:id])